In [349]:
import pandas as pd
import numpy as np 
from collections import Counter

In [350]:
file = 'Resources/purchase_data.csv'
purchase_data = pd.read_csv(file)

In [351]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

## Player Count

In [352]:
gender_count = list(purchase_data["Gender"].unique())
gender_count

['Male', 'Other / Non-Disclosed', 'Female']

In [353]:
purchase_df= pd.DataFrame(purchase_data)

In [354]:
#Total Purchases
total = purchase_data["SN"].count()

In [355]:
# Unique Player Count Purchases
player_count = len(purchase_df["SN"].unique())

In [356]:
players = pd.DataFrame({"Total Players": [player_count]
                              })
players

   Total Players
0            576

## Purchasing Analysis (Total)

In [357]:
item_count = len(list(purchase_df["Item ID"].unique()))
avg_item_price = purchase_df["Price"].mean()
total_items_purchased = purchase_data["SN"].count()
sum_item_price = purchase_df["Price"].sum()

In [358]:
purchase_analysis = pd.DataFrame({"Number of Unique Items": [item_count],
                                  "Average Price": [avg_item_price],
                                  "Total Purchases": [total_items_purchased],
                                  "Total Revenue": [sum_item_price]
                              })
purchase_analysis["Average Price"] = purchase_analysis["Average Price"].map("${:.2f}".format)
purchase_analysis["Total Revenue"] = purchase_analysis["Total Revenue"].map("{:,}".format)
purchase_analysis

   Number of Unique Items Average Price  Total Purchases Total Revenue
0                     183         $3.05              780      2,379.77

In [359]:
# Setting Purchase Data Frame to Purchase ID 
purchase_id = purchase_df.set_index("Purchase ID")

## Purchasing Analysis (Gender)

In [360]:
grouped_gender= purchase_id.groupby(["Gender"])

In [361]:
gender_counts = purchase_id["Gender"].value_counts()
gender_avg = grouped_gender["Price"].mean()
gender_sum = grouped_gender["Price"].sum()
norm_total = gender_sum / gender_counts

In [362]:
summary_table = pd.DataFrame({"Purchase Count": gender_counts,
                              "Average Purchase Price": gender_avg,
                                    "Purchase Total": gender_sum,
                               "Average Purchase Total Per Person": norm_total})
summary_table["Average Purchase Price"] = summary_table["Average Purchase Price"].map("${:.2f}".format)
summary_table["Purchase Total"] = summary_table["Purchase Total"].map("${:.2f}".format)
summary_table["Average Purchase Total Per Person"] = summary_table["Average Purchase Total Per Person"].map("${:.2f}".format)
summary_table.head()

,Purchase Count,Average Purchase Price,Purchase Total,Average Purchase Total Per Person
Female,113,$3.20,$361.94,$3.20
Male,652,$3.02,$1967.64,$3.02
Other / Non-Disclosed,15,$3.35,$50.19,$3.35

## Gender Demographics

In [363]:
# Get Total Males
males = purchase_id.loc[purchase_id["Gender"] == "Male", :]
total_males = males["SN"].count()

In [364]:
# Get Male Percentage
Percentage_Males = total_males/total *100

In [365]:
#Femal Total
females = purchase_id.loc[purchase_id["Gender"] == "Female", :]
total_females = females["SN"].count()

In [366]:
#Femal Percent
Percentage_females = total_females/total * 100

In [367]:
#Other Total
other = purchase_id.loc[purchase_id["Gender"] == "Other / Non-Disclosed", :]
total_other = other["SN"].count()

In [368]:
#Other Percent
Percentage_other = total_other/total * 100

In [369]:
gender_demo = pd.DataFrame({"Percentage of Players": [Percentage_Males, Percentage_females, Percentage_other],
                              "Total Count": [total_males, total_females, total_other]
                                    },index=['male','female','other'])
gender_demo["Percentage of Players"] = gender_demo["Percentage of Players"].map("{:.2f}%".format)
gender_demo.head()

       Percentage of Players  Total Count
male                  83.59%          652
female                14.49%          113
other                  1.92%           15

## Age Demographics

In [370]:
age_bins = [0, 9.90, 14.90, 19.90, 24.90, 29.90, 34.90, 39.90, 99999]
group_names = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

In [371]:
pd.cut(purchase_id["Age"], age_bins, labels=group_names).head()

Purchase ID
0    20-24
1      40+
2    20-24
3    20-24
4    20-24
Name: Age, dtype: category
Categories (8, object): [<10 < 10-14 < 15-19 < 20-24 < 25-29 < 30-34 < 35-39 < 40+]

In [372]:
#Creating Age Groups
purchase_id["Age Group"] = pd.cut(purchase_id["Age"], age_bins, labels=group_names)
purchase_id.head()

,SN,Age,Gender,Item ID,Item Name,Price,Age Group
Purchase ID,,,,,,,
0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [373]:
age_grouped= purchase_id.groupby(["Age Group"])

In [374]:
age_group_count= purchase_id["Age Group"].value_counts()
age_group_percent = age_group_count/player_count *100

In [375]:
age_table = pd.DataFrame({"Percentage of Players": age_group_percent,
                            "Total Counts": age_group_count
                         }, index =['<10', '10-14','15-19','20-24','25-29','30-34','35-39','40+'])
age_table["Percentage of Players"] = age_table["Percentage of Players"].map("{:.2f}%".format)
age_table

      Percentage of Players  Total Counts
<10                   3.99%            23
10-14                 4.86%            28
15-19                23.61%           136
20-24                63.37%           365
25-29                17.53%           101
30-34                12.67%            73
35-39                 7.12%            41
40+                   2.26%            13

## Purchasing Analysis (Age)

In [376]:
age_avg = age_grouped["Price"].mean()
age_sum = age_grouped["Price"].sum()
age_total_avg = age_sum / age_group_count

In [377]:
age_analysis = pd.DataFrame({"Total Counts": age_group_count,
                             "Average Purchase Price":age_avg,
                             "Total Purchase Value": age_sum,
                             "Average Purchase Total per Person": age_total_avg
                                 })
age_analysis["Average Purchase Price"] = age_analysis["Average Purchase Price"].map("${:.2f}".format)
age_analysis["Total Purchase Value"] = age_analysis["Total Purchase Value"].map("${:.2f}".format)
age_analysis["Average Purchase Total per Person"] = age_analysis["Average Purchase Total per Person"].map("${:.2f}".format)
age_analysis

,Total Counts,Average Purchase Price,Total Purchase Value,Average Purchase Total per Person
10-14,28,$2.96,$82.78,$2.96
15-19,136,$3.04,$412.89,$3.04
20-24,365,$3.05,$1114.06,$3.05
25-29,101,$2.90,$293.00,$2.90
30-34,73,$2.93,$214.00,$2.93
35-39,41,$3.60,$147.67,$3.60
40+,13,$2.94,$38.24,$2.94
<10,23,$3.35,$77.13,$3.35

## Top Spenders

In [378]:
purchase_count = purchase_data["SN"].value_counts()
purchase_count.head()

Lisosia93      5
Idastidru52    4
Iral74         4
Hada39         3
Raesty92       3
Name: SN, dtype: int64

In [379]:
SN = purchase_df.set_index("SN")
SN.head()

,Purchase ID,Age,Gender,Item ID,Item Name,Price
SN,,,,,,
Lisim78,0,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
Lisovynya38,1,40,Male,143,Frenzied Scimitar,1.56
Ithergue48,2,24,Male,92,Final Critic,4.88
Chamassasya86,3,24,Male,100,Blindscythe,3.27
Iskosia90,4,23,Male,131,Fury,1.44

In [380]:
top_spenders = purchase_df[["SN", "Price"]].groupby(by= "SN").sum().sort_values(by="Price", ascending= False).head()

In [381]:
top_spenders = {"Price" : ['count','sum','mean']}
spending_SN = purchase_df.groupby('SN').agg(top_spenders)["Price"].sort_values(by="count", ascending= False).head()
spending_SN = spending_SN.rename(columns={'count': 'Purchase Count', 'sum': 'Total Purchase Value', 'mean': 'Average Purchase Price'})

#renaming columns
cols = ['Purchase Count', 'Average Purchase Price', 'Total Purchase Value']
spending_SN.columns = cols

In [382]:
spending_SN.columns

Index(['Purchase Count', 'Total Purchase Value', 'Average Purchase Price'], dtype='object')

In [383]:
spending_SN["Total Purchase Value"] = spending_SN["Total Purchase Value"].map("${:.2f}".format)
spending_SN["Average Purchase Price"] = spending_SN["Average Purchase Price"].map("${:.2f}".format)

In [384]:
spending_SN

             Purchase Count Total Purchase Value Average Purchase Price
SN
Lisosia93                 5               $18.96                  $3.79
Iral74                    4               $13.62                  $3.40
Idastidru52               4               $15.45                  $3.86
Asur53                    3                $7.44                  $2.48
Inguron55                 3               $11.11                  $3.70

## Most Popular Item

In [385]:
item_id= purchase_df.set_index("Item ID")
item_id.head()

,Purchase ID,SN,Age,Gender,Item Name,Price
Item ID,,,,,,
108,0,Lisim78,20,Male,"Extraction, Quickblade Of Trembling Hands",3.53
143,1,Lisovynya38,40,Male,Frenzied Scimitar,1.56
92,2,Ithergue48,24,Male,Final Critic,4.88
100,3,Chamassasya86,24,Male,Blindscythe,3.27
131,4,Iskosia90,23,Male,Fury,1.44

In [386]:
item_name_df = item_id.reset_index()[['Item ID','Item Name']]

In [387]:
item_grouped= item_id.groupby(["Item ID"])

In [388]:
item_counts = purchase_data["Item ID"].value_counts()
item_name = purchase_data["Item Name"].unique()
item_price = item_avg = item_grouped["Price"].mean()
item_total = item_price * item_count

In [389]:
item_analysis = pd.DataFrame({ "Purchase Count":item_counts,

                                "Item Price": item_price,
                              "Total Purchase Value": item_total
                                  })
item_analysis_sorted = item_analysis.sort_values(["Purchase Count"], ascending=False)
item_analysis_sorted["Item Price"] = item_analysis_sorted["Item Price"].map("${:.2f}".format)
item_analysis_sorted["Total Purchase Value"] = item_analysis_sorted["Total Purchase Value"].map("${:.2f}".format)
item_analysis_sorted.head()

         Purchase Count Item Price Total Purchase Value
Item ID
178                  12      $4.23              $774.09
145                   9      $4.58              $838.14
108                   9      $3.53              $645.99
82                    9      $4.90              $896.70
19                    8      $1.02              $186.66

In [390]:
item_analysis_sorted = item_analysis_sorted.merge(item_name_df.drop_duplicates(), how = "left" , on = "Item ID")
item_analysis_sorted.set_index('Item ID').head()

,Purchase Count,Item Price,Total Purchase Value,Item Name
Item ID,,,,
178,12,$4.23,$774.09,"Oathbreaker, Last Hope of the Breaking Storm"
145,9,$4.58,$838.14,Fiery Glass Crusader
108,9,$3.53,$645.99,"Extraction, Quickblade Of Trembling Hands"
82,9,$4.90,$896.70,Nirvana
19,8,$1.02,$186.66,"Pursuit, Cudgel of Necromancy"

## Most Profitable Item

In [391]:
most_profitable_item = item_analysis.sort_values(["Total Purchase Value"], ascending=False)
most_profitable_item["Item Price"] = most_profitable_item["Item Price"].map("${:.2f}".format)
most_profitable_item["Total Purchase Value"] = most_profitable_item["Total Purchase Value"].map("${:.2f}".format)
most_profitable_item.head()

         Purchase Count Item Price Total Purchase Value
Item ID
63                    2      $4.99              $913.17
139                   5      $4.94              $904.02
173                   2      $4.93              $902.19
147                   3      $4.93              $902.19
128                   5      $4.91              $898.53